КАКерамика_моя_старая_база.QW_ОграничениеДоступа/src/Documents/ДоверенностьВыданная/ДоверенностьВыданная.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="ac063c75-89dc-4887-b5a8-d36c32573ef7">
  <name>ДоверенностьВыданная</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="152e8561-1f33-4498-8b31-1dd4e4581f0b">
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="46c57b3d-d47b-455e-bb86-58549c682397">
    <name>Контрагент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="6a35bbdb-641b-433c-ab3e-97ff59de61c2">
    <name>ФизЛицо</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="08f4fd6e-435a-43d3-b09b-a32ccb426187">
    <name>ДокументОснование</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="728a08f9-43ad-4692-99e9-c1fc623a0e57">
    <name>Партнер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="43be4239-f48b-475a-9377-28156296412d">
    <name>ПредставлениеДокументаФизЛица</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="e6846122-36eb-4c70-9672-4a6bac40c4d4">
    <name>СуммаДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="c921c4a7-986b-4e25-b8f1-27889704ebb9">
    <name>ТипДоверенности</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="a2bfe324-c180-445b-bf9d-4ca59808c919">
    <name>Валюта</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
</mdclass:Document>

КАКерамика_моя_старая_база.QW_ОграничениеДоступа/src/Enums/ТипыВыданныхДоверенностей/ТипыВыданныхДоверенностей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="9cf02dc6-2951-47f8-a1cb-6da632e85c01">
  <name>ТипыВыданныхДоверенностей</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="e7539411-2467-458f-a079-28f296e32a33">
    <name>НаПолучениеДС</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

КАКерамика_моя_старая_база.QW_ОграничениеДоступа/src/Documents/ДоверенностьВыданная/ObjectModule.bsl
#Область ЗаполнитьНаОсновании

&После("ЗаполнитьНаОсновании")
Процедура ОД_ЗаполнитьНаОсновании(ДанныеЗаполнения)

	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаданиеНаПеревозку") Тогда
		УстановитьПривилегированныйРежим(Истина);
		ЗаполнитьПоЗаданиюНаПеревозку(ДанныеЗаполнения);
		УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли;

КонецПроцедуры

Процедура ЗаполнитьПоЗаданиюНаПеревозку(п_ЗаданиеНаПеревозку)
	
	КлючСвязи = "";
	Для каждого Пункт Из п_ЗаданиеНаПеревозку.Маршрут Цикл
		Если Пункт.Доставлено Тогда
			КлючСвязи = Пункт.КлючСвязи;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если ПустаяСтрока(КлючСвязи) Тогда
		Сообщить("! Нет отмеченных пунктов для заполнения доверенности");
		Возврат;
	КонецЕсли;
	
	Заказы = Новый Массив;
	
	НайденыСтроки = п_ЗаданиеНаПеревозку.Распоряжения.НайтиСтроки(Новый Структура("КлючСвязи", КлючСвязи));
	
	Для каждого СтрокаТЧ Из НайденыСтроки Цикл
		ТестМассив = Новый Массив;
		ТестМассив.Добавить(СтрокаТЧ.Распоряжение);
		СуммаКПолучению = СуммаКПолучению(ТестМассив);
		Если СуммаКПолучению > 0 Тогда
			Заказы.Добавить(СтрокаТЧ.Распоряжение);
		КонецЕсли;
	КонецЦикла;

	Если Заказы.Количество() = 0 Тогда
		Сообщить("! Нет заказов для заполнения доверенности");
		Возврат;
	КонецЕсли;

	Заказ1 = Заказы[0];
	
	ТипДоверенности					= Перечисления.ТипыВыданныхДоверенностей.НаПолучениеДС;
	ДокументОснование				= Заказ1;
	Организация						= Заказ1.Организация;
	Контрагент						= Заказ1.Контрагент;
	Партнер							= Заказ1.Партнер;
	ФизЛицо							= п_ЗаданиеНаПеревозку.Водитель;
	ПредставлениеДокументаФизЛица	= ДанныеПаспорта(ФизЛицо);
	СуммаДокумента					= СуммаКПолучению(Заказы); 
	Валюта							= Справочники.Валюты.НайтиПоКоду("643"); 
	
КонецПроцедуры

Функция ДанныеПаспорта(п_ФизЛицо)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДокументыФизическихЛиц.Серия КАК Серия,
		|	ДокументыФизическихЛиц.Номер КАК Номер
		|ИЗ
		|	РегистрСведений.ДокументыФизическихЛиц КАК ДокументыФизическихЛиц
		|ГДЕ
		|	ДокументыФизическихЛиц.Физлицо = &ФизЛицо
		|	И ДокументыФизическихЛиц.ВидДокумента = &ВидДокумента";
	
	Запрос.УстановитьПараметр("ВидДокумента", Справочники.ВидыДокументовФизическихЛиц.НайтиПоНаименованию("Паспорт гражданина РФ", Истина));
	Запрос.УстановитьПараметр("ФизЛицо", п_ФизЛицо);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Серия + " " + Выборка.Номер;
	КонецЕсли;

КонецФункции // ()

Функция СуммаКПолучению(п_Заказы)
	
	Рез = 0;
	Для каждого Т Из п_Заказы Цикл
		СуммаДопРеквизит = УправлениеСвойствами.ЗначениеСвойства(Т, "ПолучитьДС");
		Попытка
			СуммаЧисло = Число(СуммаДопРеквизит);
		Исключение
			СуммаЧисло = 0;
		КонецПопытки;
		Рез = Рез + СуммаЧисло;
	КонецЦикла;

	Возврат Рез;

КонецФункции // ()

#КонецОбласти
